benchmarks/out/http.txt

--- BENCH HTTP START ---

--- GO STDLIB ---
2019/03/22 23:01:50 http server started on port 8081
*** 50 connections, 10 seconds
Bombarding http://127.0.0.1:8081 for 10s using 50 connection(s)
[=======================================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     13845.96    2592.51   19453.21
  Latency        3.61ms     3.42ms   365.29ms
  HTTP codes:
    1xx - 0, 2xx - 138539, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     2.55MB/s--- DONE ---

--- FASTHTTP ---
2019/03/22 23:02:01 http server started on port 8083
*** 50 connections, 10 seconds
Bombarding http://127.0.0.1:8083 for 10s using 50 connection(s)
[=======================================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     26320.44    5190.94   34090.40
  Latency        1.89ms     8.57ms      1.25s
  HTTP codes:
    1xx - 0, 2xx - 263829, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     5.30MB/s--- DONE ---

--- OLD EVIO ---
2019/03/22 23:02:13 http server started on port 8082 (loops: 1)
*** 50 connections, 10 seconds
Bombarding http://127.0.0.1:8082 for 10s using 50 connection(s)
[=======================================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     23477.36    5492.13   32744.46
  Latency        2.12ms     1.04ms    37.45ms
  HTTP codes:
    1xx - 0, 2xx - 234979, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.72MB/s--- DONE ---

--- EVIO ---
2019/03/22 23:02:24 http server started on port 8084 (loops: 1)
*** 50 connections, 10 seconds
Bombarding http://127.0.0.1:8084 for 10s using 50 connection(s)
[=======================================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     24036.75    4578.04   32086.28
  Latency        2.08ms   601.36us    47.59ms
  HTTP codes:
    1xx - 0, 2xx - 240263, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.80MB/s--- DONE ---

--- BENCH HTTP DONE ---